Autodesk.Revit.DB.Structure.RebarCouplerError
Error states for the Rebar Coupler

Autodesk.Revit.DB.Structure.RebarCouplerError.VaryingDistanceBetweenDistributionsBars
All the bars from the selected sets, which need to be connected, must be separated by the same distance.

Autodesk.Revit.DB.Structure.RebarCouplerError.BarSegmentSmallerThanEngagement
The selected leg is shorter than the bar engagement.

Autodesk.Revit.DB.Structure.RebarCouplerError.CurvesOtherThanLine
Cannot place rebar couplers on circular legs.

Autodesk.Revit.DB.Structure.RebarCouplerError.InvalidDiameter
The selected coupler type cannot be applied to the selected bar size(s).

Autodesk.Revit.DB.Structure.RebarCouplerError.InconsistentShape
One of the selected bars has an incorrect shape.

Autodesk.Revit.DB.Structure.RebarCouplerError.BarSegmentsAreNotOnSameLine
The selected legs are not aligned.

Autodesk.Revit.DB.Structure.RebarCouplerError.BarSegementsAreNotParallel
The selected legs are not aligned.

Autodesk.Revit.DB.Structure.RebarCouplerError.IncorrectEndTreatmentCoupler
The coupler cannot be placed at an end that already has a coupler.

Autodesk.Revit.DB.Structure.RebarCouplerError.IncorrectEndTreatmentHook
The coupler cannot be placed at an end that already has a hook.

Autodesk.Revit.DB.Structure.RebarCouplerError.BarsNotTouching
The selected ends of the bars are too far apart.

Autodesk.Revit.DB.Structure.RebarCouplerError.DifferentLayout
The rebar sets have different numbers of bars.

Autodesk.Revit.DB.Structure.RebarCouplerError.IncorrectInputData
Cannot place rebar coupler.

Autodesk.Revit.DB.Structure.RebarCouplerError.ValidationSuccessfuly
Bars can be coupled